In [1]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine
from matplotlib import pyplot as plt
import urllib

# MySQL 연동객체
pymysql.install_as_MySQLdb()
import MySQLdb

#### 데이터베이스 접속하기

In [2]:
HOSTNAME = "localhost"
PORT     = 3306
USERNAME = "root"
PASSWORD = "root"
DATABASE = "myschool"
CHARSET1  = "utf8"     # MySQL에서 사용할 캐릭터셋 이름
CHARSET2  = "utf-8"    # Python에서 사용할 캐릭터셋 이름

In [3]:
con_str_fmt = "mysql+mysqldb://{0}:{1}@{2}:{3}/{4}?charset={5}"

# 비밀번호에 따옴표나 @ 등의 특수문자가 포함되어 있을 경우 urllib.parse.quote() 함수로 처리후 적용
con_str = con_str_fmt.format(USERNAME, urllib.parse.quote(PASSWORD), 
                             HOSTNAME, PORT, DATABASE, CHARSET1)
con_str

'mysql+mysqldb://root:root@localhost:3306/myschool?charset=utf8'

In [4]:
engine = create_engine(con_str, encoding=CHARSET2)
conn = engine.connect()

#### DataFarme 생성

In [5]:
df1 = pd.DataFrame([
        {"deptno": 300, "dname": "학과1", "loc": "위치1"},
        {"deptno": 301, "dname": "학과2", "loc": "위치2"},
        {"deptno": 302, "dname": "학과3", "loc": "위치3"}
    ])
df1

   deptno dname  loc
0     300   학과1  위치1
1     301   학과2  위치2
2     302   학과3  위치3

#### DataFrame을 DB에 저장하기

In [6]:
df1.to_sql(name="department_py", 
           con=conn, 
           if_exists='replace', index=True)

#### 인덱스 컬럼이 있는 DateFarme 저장하기

In [8]:
# DataFrame 생성

df2 = pd.DataFrame([
        {"deptno": 300, "dname": "학과1", "loc": "위치1"},
        {"deptno": 301, "dname": "학과2", "loc": "위치2"},
        {"deptno": 302, "dname": "학과3", "loc": "위치3"}
    ])
df2.set_index('deptno', inplace=True)
df2

       dname  loc
deptno
300      학과1  위치1
301      학과2  위치2
302      학과3  위치3

In [9]:
# 데이터 저장
df2.to_sql(name="department_py", con=conn, if_exists='replace', index=True)

#### 데이터 조회하기

In [10]:
# 부분 조회
sql = """
    SELECT deptno, dname, loc
    FROM department_py
    WHERE deptno = 300
"""
df3 = pd.read_sql(sql, conn, index_col="deptno")
df3

       dname  loc
deptno
300      학과1  위치1

In [11]:
# 특정테이블 전체 조회
df4 = pd.read_sql_table("department_py", 
                        index_col='deptno', 
                        con=conn)
df4

       dname  loc
deptno
300      학과1  위치1
301      학과2  위치2
302      학과3  위치3

In [12]:
# 가져올 컬럼 지정하기

df5 = pd.read_sql_table("department_py", 
                        index_col='deptno',
                        columns=['dname'], 
                        con=conn)
df5

       dname
deptno
300      학과1
301      학과2
302      학과3

#### 데이터베이스 접속 해제하기
데이터 조회 완료후 더이상 사용되지 않는 접속객체는 반드시

cloas() 함수를 호출해야 컴퓨터의 자원낭비를 방지할 수 있다.

In [13]:
# 접속해제
conn.close()